In [35]:
import pandas as pd
import numpy as np
import datetime as dt

Q64. 데이터를 로드하고 각 열의 데이터 타입을 파악하라

In [3]:
Url = 'https://raw.githubusercontent.com/Datamanim/pandas/main/timeTest.csv'
df = pd.read_csv(Url)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6574 entries, 0 to 6573
Data columns (total 13 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Yr_Mo_Dy  6574 non-null   object
 1   RPT       6568 non-null   float64
 2   VAL       6571 non-null   float64
 3   ROS       6572 non-null   float64
 4   KIL       6569 non-null   float64
 5   SHA       6572 non-null   float64
 6   BIR       6574 non-null   float64
 7   DUB       6571 non-null   float64
 8   CLA       6572 non-null   float64
 9   MUL       6571 non-null   float64
 10  CLO       6573 non-null   float64
 11  BEL       6574 non-null   float64
 12  MAL       6570 non-null   float64
dtypes: float64(12), object(1)
memory usage: 667.8+ KB

Q65. Yr_Mo_Dy을 판다스에서 인식할 수 있는 datetime64타입으로 변경하라

In [4]:
df.Yr_Mo_Dy = df.Yr_Mo_Dy.astype('datetime64[ns]')

In [5]:
df.Yr_Mo_Dy = pd.to_datetime(df.Yr_Mo_Dy)

In [6]:
df.Yr_Mo_Dy.dtype.str, df.Yr_Mo_Dy.dtype.type

('<M8[ns]', numpy.datetime64)

### Datetime타입으로 변환
① pd.to_datetime()  

② df['date'] = df['date'].astype('str')
<br> df['date'].apply(lambda _ : datetime.strptime(_,'%Y-%m-%d'))

    ### strftime : 시간을 문자열로

    ### strptime : 날짜,시간형식의 문자열을 datetime으로

In [36]:
# datetime64에서 string으로 바꾸기

t = dt.datetime(2021, 3, 24, 11, 58, 50)
print(t.strftime('%d%m%Y'))
print(t.strftime('%Y-%m-%d %H:%M:%S'))
print(t.strftime('%y-%m-%d %H:%M:%S'))
print(t.strftime('%w'))
print(t.strftime('%U'))

24032021
2021-03-24 11:58:50
21-03-24 11:58:50
3
12

66.Yr_Mo_Dy에 존재하는 년도의 유일값을 모두 출력하라

In [ ]:
df.Yr_Mo_Dy.dt.year.unique()

## Q67. Yr_Mo_Dy에 년도가 2061년 이상의 경우에는 모두 잘못된 데이터이다. 해당경우의 값은 100을 빼서 새롭게 날짜를 Yr_Mo_Dy 컬럼에 정의하라

In [ ]:
import datetime as dt

In [ ]:
date_fix = df.loc[df.Yr_Mo_Dy.dt.year>=2061, 'Yr_Mo_Dy']
date_fix.head(3)

In [ ]:
pd.concat([date_fix.dt.year-100, date_fix.dt.month, date_fix.dt.day], axis = 1).head(3)

In [ ]:
def fix(x):
    year = x.year - 100 if x.year >= 2061 else x.year
    return pd.to_datetime(dt.date(year, x.month, x.day))

df['Yr_Mo_Dy'] = df['Yr_Mo_Dy'].apply(fix)
df.head(3)

In [ ]:
def fix_year(x):
    year = x.year - 100 if x.year>=2061 else x.year
    return pd.to_datetime(dt.date(year, x.month, x.day))
df.Yr_Mo_Dy.apply(fix_year)

In [ ]:
dt.date(2022, 3, 23), dt.time(9, 18, 33)

In [ ]:
dt.date(2022, 3, 23).strftime('%Y-%m-%d')

Q68. 년도별 각컬럼의 평균값을 구하여라

In [8]:
df.head(3)

,Yr_Mo_Dy,RPT,VAL,ROS,KIL,SHA,BIR,DUB,CLA,MUL,CLO,BEL,MAL
0,2061-01-01,15.04,14.96,13.17,9.29,NaN,9.87,13.67,10.25,10.83,12.58,18.50,15.04
1,2061-01-02,14.71,NaN,10.83,6.50,12.62,7.67,11.50,10.04,9.79,9.67,17.54,13.83
2,2061-01-03,18.50,16.88,12.33,10.13,11.17,6.17,11.25,NaN,8.50,7.67,12.75,12.71

In [9]:
df.groupby(df['Yr_Mo_Dy'].dt.year).mean().head(3)

,Yr_Mo_Dy,RPT,VAL,ROS,KIL,SHA,BIR,DUB,CLA,MUL,CLO,BEL,MAL
Yr_Mo_Dy,,,,,,,,,,,,,
1971,1971-07-02 00:00:00,11.273123,9.095178,11.088329,5.241507,9.440329,6.097151,8.385890,6.757315,7.915370,7.229753,12.208932,15.025233
1972,1972-07-01 12:00:00,12.463962,10.561311,12.058333,5.929699,9.430410,6.358825,9.704508,7.680792,8.357295,7.515273,12.727377,15.028716
1973,1973-07-02 00:00:00,11.828466,10.680493,10.680493,5.547863,9.640877,6.548740,8.482110,7.614274,8.245534,7.812411,12.169699,15.441096

In [10]:
df.groupby(df.Yr_Mo_Dy.dt.year).mean().head(3)

,Yr_Mo_Dy,RPT,VAL,ROS,KIL,SHA,BIR,DUB,CLA,MUL,CLO,BEL,MAL
Yr_Mo_Dy,,,,,,,,,,,,,
1971,1971-07-02 00:00:00,11.273123,9.095178,11.088329,5.241507,9.440329,6.097151,8.385890,6.757315,7.915370,7.229753,12.208932,15.025233
1972,1972-07-01 12:00:00,12.463962,10.561311,12.058333,5.929699,9.430410,6.358825,9.704508,7.680792,8.357295,7.515273,12.727377,15.028716
1973,1973-07-02 00:00:00,11.828466,10.680493,10.680493,5.547863,9.640877,6.548740,8.482110,7.614274,8.245534,7.812411,12.169699,15.441096

Q69. weekday컬럼을 만들고 요일별로 매핑하라 ( 월요일: 0 ~ 일요일 :6)

In [11]:
df.Yr_Mo_Dy.dt.day_name().head(3)

0    Saturday
1      Sunday
2      Monday
Name: Yr_Mo_Dy, dtype: object

In [12]:
df['weekday'] = df.Yr_Mo_Dy.dt.weekday
df.head(3)

,Yr_Mo_Dy,RPT,VAL,ROS,KIL,SHA,BIR,DUB,CLA,MUL,CLO,BEL,MAL,weekday
0,2061-01-01,15.04,14.96,13.17,9.29,NaN,9.87,13.67,10.25,10.83,12.58,18.50,15.04,5
1,2061-01-02,14.71,NaN,10.83,6.50,12.62,7.67,11.50,10.04,9.79,9.67,17.54,13.83,6
2,2061-01-03,18.50,16.88,12.33,10.13,11.17,6.17,11.25,NaN,8.50,7.67,12.75,12.71,0

## dt.day_name() : 요일이름
## dt.weekday : 요일 number

Q70. weekday컬럼을 기준으로 주말이면 1 평일이면 0의 값을 가지는 WeekCheck 컬럼을 만들어라

In [13]:
df['WeekCheck'] = df.weekday.apply(lambda x: 1 if x in (6,7) else 0)

In [14]:
df.WeekCheck.head(3)

0    0
1    1
2    0
Name: WeekCheck, dtype: int64

Q71. 년도, 일자 상관없이 모든 컬럼의 각 달의 평균을 구하여라

In [15]:
a = df.groupby(df.Yr_Mo_Dy.dt.month).mean()
a.head(3)

,Yr_Mo_Dy,RPT,VAL,ROS,KIL,SHA,BIR,DUB,CLA,MUL,CLO,BEL,MAL,weekday,WeekCheck
Yr_Mo_Dy,,,,,,,,,,,,,,,
1,2025-02-04 22:40:00.000000000,14.847325,12.914560,13.299624,7.199498,11.667734,8.054839,11.819355,9.512047,9.543208,10.053566,14.550520,18.028763,2.998208,0.145161
2,2025-02-20 00:22:40.629921280,13.710906,12.111122,12.879132,6.942411,11.551772,7.633858,11.206024,9.341437,9.313169,9.518051,13.728898,17.156142,3.001969,0.143701
3,2025-04-05 04:00:00.000000000,13.158687,11.505842,12.648118,7.265907,11.554516,7.959409,11.310179,9.635896,9.700324,10.096953,13.810609,16.909317,2.996416,0.139785

## Q72. 모든 결측치는 컬럼기준 직전의 값으로 대체하고 첫번째 행에 결측치가 있을경우 뒤에있는 값으로 대체하라

In [16]:
df = df.fillna(method ='ffill').fillna(method = 'bfill')

In [17]:
df.isnull().sum()

Yr_Mo_Dy     0
RPT          0
VAL          0
ROS          0
KIL          0
SHA          0
BIR          0
DUB          0
CLA          0
MUL          0
CLO          0
BEL          0
MAL          0
weekday      0
WeekCheck    0
dtype: int64

## Q73. 년도 - 월을 기준으로 모든 컬럼의 평균값을 구하여라

In [18]:
df.groupby([df.Yr_Mo_Dy.dt.year, df.Yr_Mo_Dy.dt.month]).mean().head(3)

                             Yr_Mo_Dy        RPT        VAL        ROS
Yr_Mo_Dy Yr_Mo_Dy
1971     1        1971-01-16 00:00:00  15.098065  13.398387  13.080000  \
         2        1971-02-14 12:00:00  11.724643   9.757143  10.311786
         3        1971-03-16 00:00:00  10.844839   8.243226  11.228387

                        KIL        SHA       BIR        DUB    CLA       MUL
Yr_Mo_Dy Yr_Mo_Dy
1971     1         6.364194  11.342258  7.759677  10.297419  8.350  8.979355  \
         2         5.242143   9.676786  5.492143   8.683929  7.075  8.272857
         3         5.629032   8.960000  5.486774   9.061935  6.700  8.494516

                        CLO        BEL        MAL   weekday  WeekCheck
Yr_Mo_Dy Yr_Mo_Dy
1971     1         8.666774  14.392581  16.360000  3.193548   0.161290
         2         7.833571  12.883929  15.863214  3.000000   0.142857
         3         7.758387  11.510000  15.678387  2.806452   0.129032

In [19]:
df.groupby(df.Yr_Mo_Dy.dt.to_period('M')).mean().head(3)

,Yr_Mo_Dy,RPT,VAL,ROS,KIL,SHA,BIR,DUB,CLA,MUL,CLO,BEL,MAL,weekday,WeekCheck
Yr_Mo_Dy,,,,,,,,,,,,,,,
1971-01,1971-01-16 00:00:00,15.098065,13.398387,13.080000,6.364194,11.342258,7.759677,10.297419,8.350,8.979355,8.666774,14.392581,16.360000,3.193548,0.161290
1971-02,1971-02-14 12:00:00,11.724643,9.757143,10.311786,5.242143,9.676786,5.492143,8.683929,7.075,8.272857,7.833571,12.883929,15.863214,3.000000,0.142857
1971-03,1971-03-16 00:00:00,10.844839,8.243226,11.228387,5.629032,8.960000,5.486774,9.061935,6.700,8.494516,7.758387,11.510000,15.678387,2.806452,0.129032

In [20]:
df.groupby(df.Yr_Mo_Dy.dt.to_period('Y')).mean().head(3)

,Yr_Mo_Dy,RPT,VAL,ROS,KIL,SHA,BIR,DUB,CLA,MUL,CLO,BEL,MAL,weekday,WeekCheck
Yr_Mo_Dy,,,,,,,,,,,,,,,
1971,1971-07-02 00:00:00,11.273123,9.095178,11.088329,5.241507,9.440329,6.097151,8.385890,6.757315,7.915370,7.229753,12.208932,15.025233,3.002740,0.142466
1972,1972-07-01 12:00:00,12.463962,10.561311,12.058333,5.929699,9.430410,6.358825,9.704508,7.680792,8.357295,7.515273,12.727377,15.028716,3.013661,0.144809
1973,1973-07-02 00:00:00,11.828466,10.680493,10.680493,5.547863,9.640877,6.548740,8.482110,7.614274,8.245534,7.812411,12.169699,15.441096,2.991781,0.142466

Q74. RPT 컬럼의 값을 일자별 기준으로 1차차분하라

In [21]:
df.RPT.diff().head(3)

0     NaN
1   -0.33
2    3.79
Name: RPT, dtype: float64

### 1차 차분 : diff()
- 차분: non-stationary 한 데이터를 stationary하게 만들어줌

### 이동평균: rolling()
- Window 창이 이동하듯이 X축의 창을 이동하면서 Y값의 평균 최소 최대값을 구함

## Q75. RPT와 VAL의 컬럼을 일주일 간격으로 각각 이동평균한값을 구하여라

In [22]:
df[['RPT','VAL']].rolling(7).mean().head(10)

         RPT        VAL
0        NaN        NaN
1        NaN        NaN
2        NaN        NaN
3        NaN        NaN
4        NaN        NaN
5        NaN        NaN
6  14.124286  12.727143
7  13.541429  11.982857
8  13.237143  11.392857
9  12.504286  10.570000

Q76. 년-월-일:시 컬럼을 pandas에서 인식할 수 있는 datetime 형태로 변경하라. 서울시의 제공데이터의 경우 0시가 24시로 표현된다

In [23]:
url = 'https://raw.githubusercontent.com/Datamanim/pandas/main/seoul_pm.csv'
df = pd.read_csv(url)

In [25]:
df.head(3)

,(년-월-일:시),PM10등급,PM10,PM2.5등급,PM2.5,오존등급,오존,이산화질소등급,이산화질소,일산화탄소등급,일산화탄소,아황산가스등급,아황산가스
0,2021-05-15:15,보통,47.0,보통,19.0,좋음,0.017,좋음,0.023,좋음,0.4,좋음,0.003
1,2021-05-15:14,보통,43.0,보통,20.0,좋음,0.024,좋음,0.019,좋음,0.3,좋음,0.003
2,2021-05-15:13,보통,34.0,보통,24.0,보통,0.035,좋음,0.017,좋음,0.4,좋음,0.004

In [60]:
df['(년-월-일:시)'].str.split(':')

0       [2021-05-15, 15]
1       [2021-05-15, 14]
2       [2021-05-15, 13]
3       [2021-05-15, 12]
4       [2021-05-15, 11]
              ...
1234    [2021-03-25, 05]
1235    [2021-03-25, 04]
1236    [2021-03-25, 03]
1237    [2021-03-25, 02]
1238    [2021-03-25, 01]
Name: (년-월-일:시), Length: 1239, dtype: object

In [40]:
pd.to_datetime(df['(년-월-일:시)'].str.split(':')[0][0].split('-')[0], df['(년-월-일:시)'].str.split(':')[0][0].split('-')[1], df['(년-월-일:시)'].str.split(':')[0][0].split('-')[2], df['(년-월-일:시)'].str.split(':')[0][1], 0, 0)

TypeError: Argument 'fmt' has incorrect type (expected str, got int)

In [52]:
df['(년-월-일:시)'][0].dt.date

AttributeError: 'str' object has no attribute 'dt'

In [49]:
print(df['(년-월-일:시)'].str.split(':')[0].strftime('%H:%m:%s')

SyntaxError: unexpected EOF while parsing (3395530856.py, line 1)

## datetime

- year: 연도
- month: 월
- day: 일
- hour: 시
- minute: 분
- second: 초
- weekday: 요일 (0:월 ~ 6:일)
- strftime: 문자열
- date: 날짜 정보
- time: 시간 정보

### strftime 문자열로 변환
- %Y: 4자리 연도
- %m: 2자리 월
- %d: 2자리 일
- %H: 24시간 
- %M: 2자리 분
- %S: 2자리 초
- %A: 영어로 된 요일
- %B: 영어로 된 월

In [53]:
x = dt.datetime.now()
x.strftime("%A %d. %B %Y")

'Friday 02. June 2023'

In [55]:
# 문자열을 datetime으로

y = dt.datetime.strptime("2017-01-02 14:44", "%Y-%m-%d %H:%M")
y

datetime.datetime(2017, 1, 2, 14, 44)

In [56]:
y.strftime("%Y-%m-%d %H:%M")

'2017-01-02 14:44'

In [57]:
y.strftime("%Y-%m-%d %H")

'2017-01-02 14'

In [62]:
df['(년-월-일:시)'].str.split(':')[0][0]

['2021-05-15', '15']

In [64]:
z = 'df['(년-월-일:시)'].str.split(':')[0][0]'&' '&'df['(년-월-일:시)'].str.split(':')[0][1]'
dt.datetime.strptime(z, "%Y-%m-%d %H")

SyntaxError: invalid syntax (1954558118.py, line 1)